Repository: amjil/mgl-notes-app
Catalog: lib/l10n/app_*.arb
Languages: mn, zh

# appTitle
source: Mongol Notes App
mn: Монгол тэмдэглэл
zh: 蒙古笔记

# drawerLogin
source: Login
mn: Нэвтрэх
zh: 登录

# drawerLogout
source: Logout
mn: Гарах
zh: 退出

# drawerAbout
source: About
mn: Тухай
zh: 关于

# drawerRecycle
source: Recycle Bin
mn: Сэргээх сан
zh: 回收站

# drawerBackup
source: Backup
zh: 备份

# drawerSettings
source: Settings
mn: Тохиргоо
zh: 设置

# favoritesTitle
source: Favorite Notes
zh: 收藏的笔记

# favoritesEmptyMessage
source: No favorite notes
zh: 暂无收藏笔记

# noteNoTitle
source: No title
zh: 无标题

# loginHeading
source: Login
mn: Нэвтрэх
zh: 登录

# loginEmailLabel
source: Email
mn: Имэйл
zh: 邮箱

# loginPasswordLabel
source: Password
mn: Нууц үг
zh: 密码

# loginSubmit
source: Login
mn: Нэвтрэх
zh: 登录

# loginSubmitting
source: Logging in...
mn: Нэвтэрч байна...
zh: 正在登录...

# loginSuccess
source: Login successful
mn: Амжилттай нэвтэрлээ
zh: 登录成功

# loginError
source: Login failed
mn: Нэвтрэлт амжилтгүй
zh: 登录失败

# loginRegisterCta
source: Register
mn: Бүртгүүлэх
zh: 注册

# registerHeading
source: Register
mn: Бүртгүүлэх
zh: 注册

# registerEmailLabel
source: Email
mn: Имэйл
zh: 邮箱

# registerPasswordLabel
source: Password (≥6 chars)
mn: Нууц үг (≥6 тэмдэгт)
zh: 密码（至少 6 位）

# registerConfirmLabel
source: Confirm password
mn: Нууц үгээ баталгаажуулах
zh: 确认密码

# registerSubmit
source: Register
mn: Бүртгүүлэх
zh: 注册

# registerSubmitting
source: Registering...
mn: Бүртгэж байна...
zh: 正在注册...

# registerSuccess
source: Registration successful. Please log in
mn: Бүртгэл амжилттай. Нэвтрэнэ үү
zh: 注册成功，请登录

# registerError
source: Registration failed
mn: Бүртгэл амжилтгүй
zh: 注册失败

# registerLoginCta
source: Login
mn: Нэвтрэх
zh: 登录

# settingsLanguageTitle
source: Language
mn: Хэл
zh: 语言

# settingsLanguageSubtitle
source: Choose display language
mn: Интерфэйсийн хэлийг сонгох
zh: 选择界面语言

# languageDialogTitle
source: Select language
mn: Хэлээ сонгоно уу
zh: 选择语言

# languageSystem
source: Follow system
mn: Систем дагах
zh: 跟随系统

# languageMongolian
source: Mongolian
mn: Монгол
zh: 蒙古语

# languageMongolianTraditional
source: Traditional Mongolian
mn: Уламжлалт монгол бичиг
zh: 传统蒙古文

# languageChinese
source: Chinese
mn: Хятад
zh: 中文

# languageEnglish
source: English
mn: Англи
zh: 英语

# dialogClose
source: Close
mn: Хаах
zh: 关闭

# aboutFeaturesTitle
source: Features
mn: Боломжууд
zh: 功能亮点

# aboutFeatureCreateEdit
source: Create and edit notes
mn: Тэмдэглэл үүсгэж засах
zh: 创建并编辑笔记

# aboutFeatureOrganize
source: Organize notes by categories
mn: Тэмдэглэлийг ангиллаар зохион байгуулах
zh: 按类别整理笔记

# aboutFeatureUi
source: Beautiful and intuitive UI
mn: Үзэмжтэй, ойлгомжтой интерфейс
zh: 精美直观的界面

# aboutDescriptionTitle
source: App Description
mn: Аппын тайлбар
zh: 应用简介

# aboutDescriptionBody
source: A modern note-taking application built with Flutter and ClojureDart. Features include creating, editing, and organizing notes with a beautiful user interface.
mn: Flutter ба ClojureDart ашиглан бүтээсэн орчин үеийн тэмдэглэлийн апп. Тэмдэглэл үүсгэх, засах, ангилж зохион байгуулах боломжийг санал болгодог.
zh: 这是一款使用 Flutter 与 ClojureDart 构建的现代笔记应用，支持创建、编辑与分类整理笔记，界面优雅易用。

# aboutDeveloperTitle
source: Developer
mn: Хөгжүүлэгч
zh: 开发者

# aboutDeveloperBody
source: Built with ❤️ using Flutter and ClojureDart
mn: Flutter ба ClojureDart ашиглан хайртайгаар бүтээлээ
zh: 由 Flutter 与 ClojureDart 倾心打造

# aboutVersionLabel
source: Version 1.0.0
mn: Хувилбар 1.0.0
zh: 版本 1.0.0

# helpHeaderTitle
source: Help & Support
zh: 帮助与支持

# helpHeaderSubtitle
source: Get help with using the app
zh: 获取使用应用的帮助

# helpGettingStartedTitle
source: Getting Started
zh: 快速上手

# helpCreateNotesTitle
source: Create Notes
zh: 创建笔记

# helpCreateNotesDescription
source: Tap the + button to create a new note. You can add text, organize with tags, and save your thoughts.
zh: 点击 + 按钮即可创建新笔记，可输入文本、添加标签并保存想法。

# helpSearchTitle
source: Search & Find
zh: 搜索与查找

# helpSearchDescription
source: Use the search icon to find specific notes by text content or tags.
zh: 使用搜索图标即可按内容或标签快速定位笔记。

# helpOrganizeTitle
source: Organize
zh: 整理

# helpOrganizeDescription
source: Use tags and categories to keep your notes organized and easy to find.
zh: 通过标签和分类整理笔记，方便查找。

# helpCommonIssuesTitle
source: Common Issues
zh: 常见问题

# helpSyncTitle
source: Sync Issues
zh: 同步问题

# helpSyncDescription
source: If notes aren't syncing, check your internet connection and try refreshing the app.
zh: 若笔记未同步，请检查网络并尝试刷新应用。

# helpSaveTitle
source: Save Problems
zh: 保存问题

# helpSaveDescription
source: Notes auto-save as you type. If you're having issues, try closing and reopening the note.
zh: 应用会在输入时自动保存，如遇问题请尝试关闭并重新打开笔记。

# helpImportExportTitle
source: Import/Export
zh: 导入/导出

# helpImportExportDescription
source: Use the floating action button to import notes from other apps or export your data.
zh: 使用悬浮操作按钮即可从其他应用导入或导出数据。

# helpContactSupportTitle
source: Contact Support
zh: 联系支持

# helpEmailSupportTitle
source: Email Support
zh: 邮件支持

# helpEmailSupportDescription
source: Send us an email at support@notesapp.com for technical assistance.
zh: 发送邮件至 support@notesapp.com 获得技术协助。

# helpReportBugsTitle
source: Report Bugs
zh: 报告问题

# helpReportBugsDescription
source: Found a bug? Use the bug report feature in the settings menu.
zh: 发现 Bug？请在设置菜单中使用问题上报功能。

# helpFeedbackTitle
source: Feedback
zh: 意见反馈

# helpFeedbackDescription
source: We'd love to hear your suggestions for improving the app.
zh: 欢迎分享改进建议，帮助我们优化应用。

# helpUserAccountTitle
source: User Account & Data
zh: 用户账户与数据

# helpLoginMigrationTitle
source: Login & Data Migration
zh: 登录与数据迁移

# helpLoginMigrationDescription
source: When you log in, all notes created in anonymous mode will automatically become part of your account. Your previous anonymous data will be transferred to your user account.
zh: 登录后，匿名模式下创建的所有笔记都会自动迁入你的账户。

# helpLogoutAccessTitle
source: Logout & Data Access
zh: 退出与数据访问

# helpLogoutAccessDescription
source: After logging out, you will not be able to access your notes. You must log in again to view and manage your data.
zh: 退出登录后无法访问笔记，需重新登录以查看和管理数据。

# helpUserOnlyTitle
source: User-Only Access
zh: 仅限登录访问

# helpUserOnlyDescription
source: All notes are tied to your user account. You must be logged in to create, view, search, and manage your notes.
zh: 所有笔记都会绑定到用户账户，必须登录才能创建、查看、搜索和管理。

# helpAppLockSectionTitle
source: App Lock & Security
zh: 应用锁与安全

# helpAppLockFeatureTitle
source: App Lock
zh: 应用锁

# helpAppLockFeatureDescription
source: App Lock protects your notes with a password. Once enabled, the app will automatically lock after a period of inactivity.
zh: 应用锁允许你用密码保护笔记，启用后应用在空闲一段时间后会自动锁定。

# helpAppLockWarningTitle
source: Important Warning
zh: 重要警告

# helpAppLockWarningDescription
source: ⚠️ CRITICAL: If you forget your unlock password, you will permanently lose access to ALL your data. There is no password recovery option. Please remember your password carefully!
zh: ⚠️ 重要：若忘记解锁密码，所有数据将永久无法访问，且没有找回方式，请妥善保存。

# helpAppLockAutoTitle
source: Auto Lock
zh: 自动锁定

# helpAppLockAutoDescription
source: You can set an auto-lock timeout. The app will automatically lock after the specified time of inactivity.
zh: 你可以设置自动锁定时间，应用会在超出空闲时间后自动锁定。

# helpFaqTitle
source: Frequently Asked Questions
zh: 常见问答

# helpFaqBackupQuestion
source: Q: How do I backup my notes?
zh: 问：如何备份我的笔记？

# helpFaqBackupAnswer
source: A: Use the export feature in the floating action button to backup your notes.
zh: 答：使用悬浮按钮中的导出功能即可备份笔记。

# helpFaqOfflineQuestion
source: Q: Can I use the app offline?
zh: 问：应用能离线使用吗？

# helpFaqOfflineAnswer
source: A: Yes! Notes are saved locally and will sync when you're back online.
zh: 答：可以！笔记会在本地保存，联网后自动同步。

# emptyNotesMessage
source: No notes
zh: 暂无笔记

# emptyNotesError
source: Error When Fetching Notes
zh: 获取笔记时出错

# emptySearchResultsMessage
source: No search results found
zh: 未找到搜索结果

# emptyTagsMessage
source: No tags
zh: 暂无标签

# emptyBlocksMessage
source: No blocks
zh: 暂无块

# emptyExportFilesMessage
source: Export files not found
zh: 未找到导出文件

# emptyExportFilesError
source: Error When Fetching Export Files
zh: 获取导出文件时出错

# emptyBackupFilesMessage
source: No backup files found
zh: 未找到备份文件

# editorTextColor
source: Text Color
zh: 文字颜色

# editorBlockProperties
source: Block Properties
zh: 块属性

# editorTodo
source: Todo
zh: 待办

# editorBackground
source: Background
zh: 背景

# editorPlaceholder
source: Placeholder
zh: 占位符
